In [1]:
# There are six main SQL constraints —
# NOT NULL, UNIQUE, PRIMARY KEY, FOREIGN KEY, CHECK, and DEFAULT.

# AUTO_INCREMENT is not a constraint — it’s a column attribute that automatically generates unique numbers, 
# usually used with a primary key.

In [1]:
# Most Common SQL Commands - Syntax and Examples -

In [2]:
# - CREATE - Creates a new table or database.

# Syntax:
# CREATE TABLE table_name (column1 datatype, column2 datatype);

# Example:
# CREATE TABLE students (id INT, name VARCHAR(50), age INT);

In [3]:
# - INSERT - Adds new data into a table.

# Syntax:
# INSERT INTO table_name (column1, column2) VALUES (value1, value2);

# Example:
# INSERT INTO students (id, name, age) VALUES (1, 'Riya', 20);

In [4]:
# - SELECT - Fetches data from a table.

# Syntax:
# SELECT column1, column2 FROM table_name;

# Example:
# SELECT * FROM students;

In [5]:
# - DELETE - Deletes data from a table.

# Syntax:
# DELETE FROM table_name WHERE condition;

# Example:
# DELETE FROM students WHERE id = 1;

In [6]:
# - UPDATE - Updates existing data.
    
# Syntax:
# UPDATE table_name SET column1 = value1 WHERE condition;

# Example:
# UPDATE students SET age = 21 WHERE name = 'Riya';

In [7]:
# - ALTER - Changes table structure.
    
# Syntax:
# ALTER TABLE table_name ADD column_name datatype;

# Example:
# ALTER TABLE students ADD COLUMN grade VARCHAR(10);

In [8]:
# - DROP - Deletes a table or database.

# Syntax:
# DROP TABLE table_name;

# Example:
# DROP TABLE students;

In [9]:
# - WHERE - Filters data by condition.
    
# Syntax:
# SELECT * FROM table_name WHERE condition;

# Example:
# SELECT * FROM students WHERE age > 18;

In [10]:
# - ORDER BY - Sorts results.

# Syntax:
# SELECT * FROM table_name ORDER BY column_name ASC|DESC;

# Example:
# SELECT * FROM students ORDER BY age DESC;

In [11]:
# - GROUP BY - Groups rows for aggregate functions.

# Syntax:
# SELECT column, COUNT(*) FROM table GROUP BY column;

# Example:
# SELECT grade, COUNT(*) FROM students GROUP BY grade;

In [12]:
# - HAVING - Filters grouped data.
    
# Syntax:
# SELECT column, COUNT(*) FROM table GROUP BY column HAVING condition;

# Example:
# SELECT grade, COUNT(*) FROM students GROUP BY grade HAVING COUNT(*) > 2;

In [13]:
# - JOIN - Combines data from multiple tables.

# Syntax:
# SELECT t1.col, t2.col FROM t1 JOIN t2 ON t1.id = t2.id;

# Example:
# SELECT students.name, marks.score FROM students JOIN marks ON students.id = marks.student_id;

In [14]:
# - DISTINCT - Removes duplicate values.
    
# Syntax:
# SELECT DISTINCT column_name FROM table_name;

# Example:
# SELECT DISTINCT grade FROM students;

In [15]:
# - LIMIT - Limits number of rows shown.

# Syntax:
# SELECT * FROM table_name LIMIT number;

# Example:
# SELECT * FROM students LIMIT 5;

In [16]:
# - BETWEEN / IN / LIKE - Used in WHERE for filters.

# Syntax:
# BETWEEN: SELECT * FROM students WHERE age BETWEEN 18 AND 22;

# IN: SELECT * FROM students WHERE grade IN ('A', 'B');

# LIKE: SELECT * FROM students WHERE name LIKE 'R%';

In [17]:
# - TRUNCATE - Deletes all rows quickly.
    
# Syntax:
# TRUNCATE TABLE table_name;

# Example:
# TRUNCATE TABLE students;

In [18]:
# - CREATE DATABASE - Creates a database.

# Syntax:
# CREATE DATABASE db_name;

# Example:
# CREATE DATABASE school;

#--------------------------------
# - USE

# Selects a database to work on.
# Syntax:
# USE db_name;
# Example:
# USE school;